In [ ]:
"""
Importation d'un fichier

Éditeur : Laurent REYNAUD
Date : 07-07-2021
"""

In [2]:
import pandas as pd

In [3]:
"Importation du fichier"

titanic = pd.read_csv('data/titanic.csv')
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# Moyenne avec mean() : ici âge moyen des passagers
titanic['Age'].mean()

29.69911764705882

In [6]:
# Médiane avec median() : âge et tarif median -> attention [[]] !
titanic[['Age', 'Fare']].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [7]:
# Statistiques sur certaines colonnes avec describe()
titanic[['Age', 'Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [9]:
# Statistiques ciblées sur certaines colonnes avec agg()

titanic.agg(
    {
        "Age": ["min", "max", "median"],
        "Fare": ["min", "max", "median"],
    }
)

          Age      Fare
min      0.42    0.0000
max     80.00  512.3292
median  28.00   14.4542

In [11]:
# Statistiques sur plusieurs colonnes et plusieurs index avec groupby()
# Moyennes pour chaque colonne hommes / femmes
titanic.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [13]:
# Statistiques sur plusieurs colonnes et plusieurs index avec groupby()
# Age moyen hommes / femmes
titanic.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [10]:
# Statistiques sur plusieurs colonnes et plusieurs index avec groupby()
# Agê moyen hommes / femmes sous une autre présentation
titanic[["Sex", "Age"]].groupby("Sex").mean()

              Age
Sex
female  27.915709
male    30.726645

In [14]:
# Statistiques sur plusieurs colonnes et plusieurs index avec groupby()
# Tarif moyen hommes / femmes pour chaque classe
titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

In [15]:
# Nombre de données avec les méthodes value_count() et count()
# Nombre de passagers par classe
titanic["Pclass"].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
# Nombre de données avec les méthodes value_count() et count()
# Nombre de passagers par classe avec une autre instruction
titanic.groupby("Pclass")["Pclass"].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64